[
	{
		"sectionName": "Introduction",
		"blocks": [
			{
				"blockName": "Max Klinman",
				"paragraphs": [
					"Programmer / Web Designer <br> Passionate and hardworking; always excited to learn new things.",
					"Current Occupation: Student @ <a href ='https://www.uci.edu'>UCI</a><br> Major: Computer Science"
				]	
			}
		]
	},
	{
		"sectionName": "Projects",
		"blocks": [
			{
				"blockName": "Hack @ UCI - A.R.T. Artist's Realtime Toolkit [Winter 2020]",
				"paragraphs": [
					"<img src='assets/artlogo.jpg' />",
					"My team's <a href='https://devpost.com/software/hackuci-2020'>submission.</a> The project for this hackathon was to create a tool for aspiring digital artists to more easily draw on their computers. Most digital artists day have to spend a lot of money on expensive drawing tablets, so we set out to lower the barrier of entry by allow users to use their phones to draw on their computers. We successfully made two iterations of the project.",
					"<img src='assets/artdemo.jpg' />",
				       	"The first is just a collaborative drawing app where strokes on canvas appear as strokes on another, linked together by a common ID. The <b>second</b> iteration is where a user's phone can act like a pointer on the screen and be used to draw like you're using a wiimote. (Simply change the mode on both the computer and phone to 'Pointer' to see it in action.",
					"A demo of the project is available <a href='https://art.kartik-b.com/'>here</a>.",
					"Skills: Coffee/Tea/Monster/Gatorade(?)"
				]	
			},
			{
				"blockName": "Augmented Reality Fitness Research Study [Ongoing]",
				"paragraphs": [
					"I'm currently in-progress with a research group at UCI trying to figure out a new innovative way to workout with Microsoft Hololens.",
					"You can learn more about CalIT2 (the research group I'm with) <a href='http://www.calit2.uci.edu'>here</a>.",
					"Skills: Unity, Microsoft Hololens, Microsoft Mixed Reality Toolkit, Git"
				]	
			},
			{
				"blockName": "BananaToken Arcade [Ongoing]",
				"paragraphs": [
					"<img src='assets/bta_logo.svg' />",
					"<a href='https://www.bananatokenarcade.com'><i>BananaToken Arcade</i></a> is my personal collection of HTML5 and Flash games that I've developed. I first made The website in 2014 and since then a small community has grown around it. The website has a custom user registration and login system run behind the scenes in a MySQL database. The backend is comprised of a mix of NodeJS and PHP.",
					"The source code for the games is available <a href='https://www.github.com/Bloxore/Banana-Token-Games-2.0'> here</a>.",
					"Skills: Javascript, jQuery, anime.js, HTML, CSS, PHP, SQL, MySQL Databases, HTML5, Phaser3, Flash (AS3)"
				]	
			},
			{
				"blockName": "Local Hack Day UCI 2019 - Gameboy Assembly [Fall 2019]",
				"paragraphs": [
					"<img src='assets/hackday.png' />",
					"This was a smaller hackathon experience at ~16 hours long, and rather informal. Yet that didn't stop me and my close friend from learning Gameboy Assembly and implementing a small visual experience.",
					"<img src='assets/hackday2.png' />",
					"The result fantastic and the experience enlightening.",
					"The source code is <a href='https://www.github.com/Bloxore/LHD_GBASM_UCI19'>here</a>.",
					"Skills: GB ASM, Git, Bash, Bat"
				]
			},
                        {
				"blockName": "HackSC Project - Virtual Dog [2019 Spring]",
				"paragraphs": [
					"<img src='assets/vrdog.png' />",
					"My team's <a href='https://devpost.com/software/virtual-dog-nj9prm'>submission</a> for 2019's HackSC Hackathon. The concept is a VR mobile/desktop game where virtually interact and play with a dog. The app even includes voice commands to increase immersion. My team used Unity for the project, my role was as primary programmer (in C#).",
					"<img src='assets/vrdog2.jpg' />",
					"My team won first place in two categories for this hack: the entertainment vertical (major category) and hacker's choice (most popular hack).",
                                        "The source code for the hack is available <a href='https://github.com/mengvf/Nintendoggos'> here</a>.",
					"Skills: Unity, C#, Git, VR"
				]	
			},
                        {
				"blockName": "Hack @ UCI - Abrupt Cow Chat [2019 Winter]",
				"paragraphs": [
					"<img src='assets/cowchat.jpg' />",
					"My team's <a href='https://devpost.com/software/hack-uci-2019'>submission</a> for 2019's HackUCI Hackathon. The concept was simple, create something and submit it so we can get practice working in teams. We did just that and settled on an early internet style chat application. We also made a 90's style website to go along with it.",
				       	"<img src='assets/cowchat2.png' />",	
					"Github source available <a href='https://www.github.com/Bloxore/Hack-UCI-2019'>here</a>.",
					"Skills: Python, Nodejs, Google Cloud Services"
				]	
			},
			{
				"blockName": "Proto Game Jam - Spiral Drift [Fall 2018]",
				"paragraphs": [
					"<img src='assets/drift.png' />",
					"My team's <a href='https://fauxtrot.itch.io/spiral-drift'>submission</a>. This was my first UCI hackathon, and I was in a really nice group that helped me learn the ropes of Unity. We ended up creating a racing game where the goal is demolish as much stuff as you can, but you can only destroy things by drifting into them. It was grueling, but very rewarding and results looked great!",
					"The source code for this game is no longer available to me.",
					"Skills: Unity, C#, Blender"
				]	
			},
			{
				"blockName": "This Portfolio [Meta]",
				"paragraphs": [
					"A neat corner of the internet for me to list my Computer Science endeavours.",
					"The source code for this website is available <a href='https://www.github.com/Bloxore/Bloxore.github.io'> here</a>.",
					"Skills: Vim, Git, Bash (Linux System), Javascript, React, Scss [Sass], jQuery, HTML, CSS, JSON"
				]	
			}
		]
	},
	{
		"sectionName": "Collections",
		"blocks": [
			{
				"blockName": "Github",
				"paragraphs": [
					"Collection of all my coding projects, if it's mentioned on this website there's a 90% chance you can find it <a href='https://www.github.com/Bloxore'>here too</a>."
				]	
			},
			{
				"blockName": "Codepen.io",
				"paragraphs": [
					"A Rather old collection of some of my web design work before college, there are some gems in there. You can find it <a href='https://www.codepen.io/Bloxore'>here</a>."
				]	
			}
		]
	}
]
